In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
import numpy as np
import pandas as pd

pd.Series - 1D labeled homogenously-typed array
pd.DataFrame - General 2D labeled, size-mutable tabular structure
pd.Panel - General 3D labeled, size-muatable array

Series

In [3]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s

a    1.066291
b   -0.503607
c    1.389175
d    0.304874
e    0.855391
dtype: float64

In [4]:
#Attributes
s.index
s.values
s.shape

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

array([ 1.06629053, -0.50360673,  1.38917535,  0.30487404,  0.85539082])

(5,)

If Data is a dictionary, if index is passed the values in data corresponding to the labels in the index will be pulled out, otherwise an index will be constructed from the sorted keys of the dict.

In [5]:
d = {'a': [0., 0], 'b': {'1':1.}, 'c': 2.}
pd.Series(d)

a      [0.0, 0]
b    {'1': 1.0}
c             2
dtype: object

You can create a series from a scalar, but need to specify indices

In [6]:
pd.Series(5, index = ['a', 'b', 'c'])

a    5
b    5
c    5
dtype: int64

Indexing and Slicing and Other operations

In [7]:
s[0]
s[:3]
s['e']
'f' in s #check for index label
s>s.mean()
print(s.get('f',None)) #get item with index 'f' - if no such item return None

1.0662905302476573

a    1.066291
b   -0.503607
c    1.389175
dtype: float64

0.8553908201457694

False

a     True
b    False
c     True
d    False
e     True
dtype: bool

None

Series Iteration

In [8]:
for idx,val in s.iteritems():
    print(idx,val)
s.sort_values()
s.sort_index()
s.value_counts()

a 1.0662905302476573
b -0.5036067348298664
c 1.3891753508932259
d 0.3048740392703832
e 0.8553908201457694

b   -0.503607
d    0.304874
e    0.855391
a    1.066291
c    1.389175
dtype: float64

a    1.066291
b   -0.503607
c    1.389175
d    0.304874
e    0.855391
dtype: float64

 1.389175    1
 1.066291    1
 0.855391    1
 0.304874    1
-0.503607    1
dtype: int64

Data Frame

In [9]:
# Create a dictionary of series
# Notice how it fills the column one with NaN for d
# Columns are dictionary keys, indices and values obtained from series
d = {'one': pd.Series([1,2,3], index  = ['a', 'b', 'c']), 
     'two': pd.Series(list(range(4)), index = ['a','b', 'c', 'd'])}
df = pd.DataFrame(d)
df
d= {'one': {'a': 1, 'b': 2, 'c':3}, 
     'two': pd.Series(list(range(4)), index = ['a','b', 'c', 'd'])}
df = pd.DataFrame(d)
df
pd.DataFrame(d, index = ['d', 'b', 'a'])
pd.DataFrame(d, index = ['d', 'b', 'a'], columns = ['two', 'three'])

   one  two
a  1.0    0
b  2.0    1
c  3.0    2
d  NaN    3

   one  two
a  1.0    0
b  2.0    1
c  3.0    2
d  NaN    3

   one  two
d  NaN    3
b  2.0    1
a  1.0    0

   two three
d    3   NaN
b    1   NaN
a    0   NaN

In [10]:
#From dict of ndarray / lists
d = {'one' : [1., 2., 3., 4], 'two' : [4., 3., 2., 1.]}
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [11]:
#From a list of dicts
data = []
for i in range(100):
    data += [ {'Col-' + str(j):np.random.randint(100) for j in range(5)} ]
df = pd.DataFrame(data)
df.tail()
#Only certain columns
df = pd.DataFrame(data, columns = ['Column0', 'Column1'])
df.head()

    Col-0  Col-1  Col-2  Col-3  Col-4
95      2     77     96     64      2
96      6     73     46     17     11
97     97     82     66     81     53
98     79     43     38     78     14
99      7      7     35     79     67

   Column0  Column1
0      NaN      NaN
1      NaN      NaN
2      NaN      NaN
3      NaN      NaN
4      NaN      NaN

Attributes

In [12]:
# Adding and accessing columns 
d = {'one': pd.Series([1,2,3], index  = ['a', 'b', 'c']), 
     'two': pd.Series(range(4), index = ['a','b', 'c', 'd'])}
df = pd.DataFrame(d)
df
df.info

   one  two
a  1.0    0
b  2.0    1
c  3.0    2
d  NaN    3

<bound method DataFrame.info of    one  two
a  1.0    0
b  2.0    1
c  3.0    2
d  NaN    3>

In [13]:
# multiply 
df['three'] =  df['one']*df['two']
df
# Create a boolean flag
df['flag'] = df['one'] > 2
df

   one  two  three
a  1.0    0    0.0
b  2.0    1    2.0
c  3.0    2    6.0
d  NaN    3    NaN

   one  two  three   flag
a  1.0    0    0.0  False
b  2.0    1    2.0  False
c  3.0    2    6.0   True
d  NaN    3    NaN  False

In [14]:
# inserting column in specified location, with values
df.insert(1, 'bar', df['one'][:2])
df

   one  bar  two  three   flag
a  1.0  1.0    0    0.0  False
b  2.0  2.0    1    2.0  False
c  3.0  NaN    2    6.0   True
d  NaN  NaN    3    NaN  False

In [15]:
# Deleting Columns  
three = df.pop('three')
df

   one  bar  two   flag
a  1.0  1.0    0  False
b  2.0  2.0    1  False
c  3.0  NaN    2   True
d  NaN  NaN    3  False

In [16]:
# Propagation of values
df['foo'] = 'bar'
df

   one  bar  two   flag  foo
a  1.0  1.0    0  False  bar
b  2.0  2.0    1  False  bar
c  3.0  NaN    2   True  bar
d  NaN  NaN    3  False  bar

Indexing and Slicing

Indexing and Selection

In [17]:
# Lets create a data frame
pd.options.display.max_rows = 4
dates = pd.date_range('1/1/2000', periods=8)
df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['A', 'B', 'C','D'])
df

                   A         B         C         D
2000-01-01  0.663215 -0.884595 -1.077979 -1.131413
2000-01-02  0.551558 -0.537852 -0.481538  0.395537
...              ...       ...       ...       ...
2000-01-07 -0.414912  0.428088  0.894963  0.746626
2000-01-08  0.368652 -0.863522  1.879654 -0.384938

[8 rows x 4 columns]

Simplest form of Indexing

In [18]:
# column  A
df['A']
df.loc[:,"A":"C"]
#multiple column 
df[['A', 'B']]
#slice by rows
df['2000-01-01': '2000-01-04']
#boolean mask 
df[df['A'] > df['B']].head()
#Assign via []
df['A'] = df['B'].values
df.head()
#You can also access a column by df.colname
df.A

2000-01-01    0.663215
2000-01-02    0.551558
                ...
2000-01-07   -0.414912
2000-01-08    0.368652
Freq: D, Name: A, Length: 8, dtype: float64

                   A         B         C
2000-01-01  0.663215 -0.884595 -1.077979
2000-01-02  0.551558 -0.537852 -0.481538
...              ...       ...       ...
2000-01-07 -0.414912  0.428088  0.894963
2000-01-08  0.368652 -0.863522  1.879654

[8 rows x 3 columns]

                   A         B
2000-01-01  0.663215 -0.884595
2000-01-02  0.551558 -0.537852
...              ...       ...
2000-01-07 -0.414912  0.428088
2000-01-08  0.368652 -0.863522

[8 rows x 2 columns]

                   A         B         C         D
2000-01-01  0.663215 -0.884595 -1.077979 -1.131413
2000-01-02  0.551558 -0.537852 -0.481538  0.395537
2000-01-03  0.556096  0.521615  0.187113 -0.746021
2000-01-04 -1.800563 -0.372313 -0.914770  0.964996

                   A         B         C         D
2000-01-01  0.663215 -0.884595 -1.077979 -1.131413
2000-01-02  0.551558 -0.537852 -0.481538  0.395537
...              ...       ...       ...       ...
2000-01-06  0.723311 -1.827535 -0.407968 -1.109223
2000-01-08  0.368652 -0.863522  1.879654 -0.384938

[5 rows x 4 columns]

                   A         B         C         D
2000-01-01 -0.884595 -0.884595 -1.077979 -1.131413
2000-01-02 -0.537852 -0.537852 -0.481538  0.395537
...              ...       ...       ...       ...
2000-01-04 -0.372313 -0.372313 -0.914770  0.964996
2000-01-05  1.429472  1.429472 -0.888187 -0.301086

[5 rows x 4 columns]

2000-01-01   -0.884595
2000-01-02   -0.537852
                ...
2000-01-07    0.428088
2000-01-08   -0.863522
Freq: D, Name: A, Length: 8, dtype: float64

Selecting by label .loc

In [19]:
#A single label
df.loc['2000-01-01']
#A list of labels
df.loc[:, 'A':'C']
#A boolean array
df.loc[:, df.loc['2000-01-01'] > 0]

A   -0.884595
B   -0.884595
C   -1.077979
D   -1.131413
Name: 2000-01-01 00:00:00, dtype: float64

                   A         B         C
2000-01-01 -0.884595 -0.884595 -1.077979
2000-01-02 -0.537852 -0.537852 -0.481538
...              ...       ...       ...
2000-01-07  0.428088  0.428088  0.894963
2000-01-08 -0.863522 -0.863522  1.879654

[8 rows x 3 columns]

Empty DataFrame
Columns: []
Index: [2000-01-01 00:00:00, 2000-01-02 00:00:00, 2000-01-03 00:00:00, 2000-01-04 00:00:00, 2000-01-05 00:00:00, 2000-01-06 00:00:00, 2000-01-07 00:00:00, 2000-01-08 00:00:00]

[8 rows x 0 columns]

Selecting by position

In [20]:
df=pd.DataFrame(np.random.randn(6,4), 
                   index=list(range(0,12,2)), columns=list(range(0,12,3)))

df

           0         3         6         9
0   0.124153  0.435194  0.865405  0.209685
2   0.229894 -0.432901  0.251807 -1.067002
..       ...       ...       ...       ...
8   0.270746 -2.466582  0.345738  0.667761
10 -0.511711  2.269593  0.612968 -0.230268

[6 rows x 4 columns]

In [21]:
#rows 0-2
df.iloc[:3]
#rows 1:4  and columns 2 : 4
df.iloc[1:5, 2:4]
#selecting via integer mask 
boolean_mask = df.iloc[:, 1] > 0.0
df.iloc[boolean_mask.values,1]

          0         3         6         9
0  0.124153  0.435194  0.865405  0.209685
2  0.229894 -0.432901  0.251807 -1.067002
4 -1.337814  1.131236 -0.325417 -1.489911

          6         9
2  0.251807 -1.067002
4 -0.325417 -1.489911
6  1.238272 -0.284252
8  0.345738  0.667761

0     0.435194
4     1.131236
6     1.459943
10    2.269593
Name: 3, dtype: float64

Merging Data Frames

In [22]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [4, 2]})
left
right = pd.DataFrame({'key': ['bar', 'zoo'], 'rval': [4, 5]})
right
merged = pd.merge(left, right, how="inner")
merged
merged = pd.merge(left, right, how="outer")
merged

   key  lval
0  foo     4
1  bar     2

   key  rval
0  bar     4
1  zoo     5

   key  lval  rval
0  bar     2     4

   key  lval  rval
0  foo   4.0   NaN
1  bar   2.0   4.0
2  zoo   NaN   5.0

Function Application
-applymap() method only works on a pandas dataframe where function is applied on every element individually.
-apply() method can be applied both to series and dataframes where function can be applied both series and individual elements based on the type of function provided.
-map() method only works on a pandas series where type of operation to be applied depends on argument passed as a function, dictionary or a list.

In [23]:
df=pd.DataFrame(np.random.rand(6,4),index=list(range(0,12,2)),columns=list('abcd'))
df

           a         b         c         d
0   0.703666  0.230052  0.598131  0.739917
2   0.164329  0.750533  0.481139  0.318710
..       ...       ...       ...       ...
8   0.158147  0.527058  0.648773  0.277994
10  0.989080  0.779718  0.530764  0.030829

[6 rows x 4 columns]

In [24]:
#column
df.apply(np.mean)
#row
df.apply(np.mean,axis=1)

a    0.606726
b    0.450075
c    0.554434
d    0.364969
dtype: float64

0     0.567941
2     0.428678
        ...
8     0.402993
10    0.582598
Length: 6, dtype: float64

In [25]:
#Side-Note: lambda functions allow you to specify a function without giving it a separate declaration.
lambda x: (x - x.mean())/x.std()
#Use lambda functions  to normalize columns
df=df.apply(lambda x: (x - x.mean())/ x.std(), axis = 0)
df

           a         b         c         d
0   0.261290 -0.731969  0.147656  1.263012
2  -1.192431  0.999558 -0.247667 -0.155825
..       ...       ...       ...       ...
8  -1.209093  0.256107  0.318779 -0.292978
10  1.030591  1.096648 -0.079980 -1.125553

[6 rows x 4 columns]

In [26]:
df=pd.DataFrame(np.random.randn(1000, 3), columns=['A', 'B', 'C'],
                    index=pd.date_range('1/1/2000', periods=1000))

df.head(3)

                   A         B         C
2000-01-01  0.960107 -0.218473  1.186191
2000-01-02  0.444784  0.341228 -0.551270
2000-01-03  0.658311 -0.713648 -1.322395

In [27]:
df.apply(lambda x: x.idxmax())

A   2000-08-17
B   2000-12-13
C   2000-07-18
dtype: datetime64[ns]

In [28]:
temp=df.applymap(lambda x: x-1)
temp.head(4)

                   A         B         C
2000-01-01 -0.039893 -1.218473  0.186191
2000-01-02 -0.555216 -0.658772 -1.551270
2000-01-03 -0.341689 -1.713648 -2.322395
2000-01-04 -1.154403 -1.471465 -0.891256

Input/Output Functions
-pd.read_csv / pd.to_csv
-pd.read_excel / pd.to_excel
-pd.read_sql / pd.to_sql
-pd.read_pickle / pd.to_pickle

In [29]:
iris=pd.read_csv('https://gist.githubusercontent.com/curran/a08a1080b88344b0c8a7/raw/639388c2cbc2120a14dcf466e85730eb8be498bb/iris.csv')
iris.info()
iris.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
sepal_length    150 non-null float64
sepal_width     150 non-null float64
petal_length    150 non-null float64
petal_width     150 non-null float64
species         150 non-null object
dtypes: float64(4), object(1)
memory usage: 5.9+ KB

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000      150.000    150.000000   150.000000
mean       5.843333        3.054      3.758667     1.198667
...             ...          ...           ...          ...
75%        6.400000        3.300      5.100000     1.800000
max        7.900000        4.400      6.900000     2.500000

[8 rows x 4 columns]

In [30]:
#Split/Apply Combo (groupby)
df = pd.DataFrame({'key':['A','B','C','A','B','C','A','B','C'],
                   'data': [0, 5, 10, 5, 10, 15, 10, 15, 20]})
df
sums = df.groupby('key').agg(np.mean)
sums

   key  data
0    A     0
1    B     5
..  ..   ...
7    B    15
8    C    20

[9 rows x 2 columns]

     data
key
A       5
B      10
C      15